redmorningcn/template_stm32_ucos/source/Software/uC-MB/Source/MB.h
/*
*********************************************************************************************************
*                                               DATA TYPES
*********************************************************************************************************
*/

typedef  struct  modbus_ch {
    CPU_INT08U       Ch;                               /* Channel number                                                   */
    CPU_BOOLEAN      WrEn;                             /* Indicates whether MODBUS writes are enabled for the channel      */
    CPU_INT32U       WrCtr;                            /* Incremented each time a write command is performed               */

    CPU_INT08U       NodeAddr;                         /* Modbus node address of the channel                               */

    CPU_INT08U       PortNbr;                          /* UART port number                                                 */
    CPU_INT32U       BaudRate;                         /* Baud Rate                                                        */
    CPU_INT08U       Parity;                           /* UART's parity settings (MODBUS_PARITY_NONE, _ODD or _EVEN)       */
    CPU_INT08U       Bits;                             /* UART's number of bits (7 or 8)                                   */
    CPU_INT08U       Stops;                            /* UART's number of stop bits (1 or 2)                              */

    CPU_INT08U       Mode;                             /* Modbus mode: MODBUS_MODE_ASCII or MODBUS_MODE_RTU                */

    CPU_INT08U       MasterSlave;                      /* Slave when set to MODBUS_SLAVE, Master when set to MODBUS_MASTER */

    CPU_INT16U       Err;                              /* Internal code to indicate the source of MBS_ErrRespSet()         */

#if (MODBUS_CFG_RTU_EN == DEF_ENABLED)
    CPU_INT16U       RTU_TimeoutCnts;                  /* Counts to reload in .RTU_TimeoutCtr when byte received           */
    CPU_INT16U       RTU_TimeoutCtr;                   /* Counts left before RTU timer times out for the channel           */
    CPU_BOOLEAN      RTU_TimeoutEn;                    /* Enable (when TRUE) or Disable (when FALSE) RTU timer             */
#endif

#if (MODBUS_CFG_FC08_EN == DEF_ENABLED)
    CPU_INT16U       StatMsgCtr;                       /* Statistics                                                       */
    CPU_INT16U       StatCRCErrCtr;
    CPU_INT16U       StatExceptCtr;
    CPU_INT16U       StatSlaveMsgCtr;
    CPU_INT16U       StatNoRespCtr;
#endif

    CPU_INT32U       RxTimeout;                        /* Amount of time Master is willing to wait for response from slave */

    CPU_INT32U       RxCtr;                            /* Incremented every time a character is received                   */
    CPU_INT16U       RxBufByteCtr;                     /* Number of bytes received or to send                              */
    CPU_INT16U       RxBufByteCnt;                     /* Number of bytes received or to send                              */
    CPU_INT08U      *RxBufPtr;                         /* Pointer to current position in buffer                            */
    CPU_INT08U       RxBuf[MODBUS_CFG_BUF_SIZE];       /* Storage of received characters or characters to send             */

    CPU_INT32U       TxCtr;                            /* Incremented every time a character is transmitted                */
    CPU_INT16U       TxBufByteCtr;                     /* Number of bytes received or to send                              */
    CPU_INT08U      *TxBufPtr;                         /* Pointer to current position in buffer                            */
    CPU_INT08U       TxBuf[MODBUS_CFG_BUF_SIZE];       /* Storage of received characters or characters to send             */

    CPU_INT08U       RxFrameData[MODBUS_CFG_BUF_SIZE]; /* Additional data for function requested.                          */
    CPU_INT16U       RxFrameNDataBytes;                /* Number of bytes in the data field.                               */
    CPU_INT16U       RxFrameCRC;                       /* Error check value (LRC or CRC-16).                               */
    CPU_INT16U       RxFrameCRC_Calc;                  /* Error check value computed from packet received                  */

    CPU_INT16U       RxFrameHead;                      /* 数据帧头，用于带帧头的非MODSBUS通信                              */
    CPU_INT16U       RxFrameTail;                      /* 数据帧尾，用于带帧尾的非MODSBUS通信                              */

    CPU_INT08U       TxFrameData[MODBUS_CFG_BUF_SIZE]; /* Additional data for function requested.                          */
    CPU_INT16U       TxFrameNDataBytes;                /* Number of bytes in the data field.                               */
    CPU_INT16U       TxFrameCRC;                       /* Error check value (LRC or CRC-16).                               */

    CPU_INT08U       AesEn                      : 1;   // AES加密
    CPU_INT08U       NonModbusEn                : 1;   // 非MODBUS通信支持
    CPU_INT08U       IapModbusEn                : 1;   // IAP通信支持
    CPU_INT08U       Retrys                     : 5;   // 重发次数
    OS_SEM          *RxSem;                            // 无名沈增加：指向当前接收信号量
    OS_SEM          *TxSem;                            // 无名沈增加：指向当前发送信号量
#if (MODBUS_CFG_MASTER_EN == DEF_ENABLED)
    CPU_INT08U       TxRetryCtr                 :3;
    CPU_INT08U       RxFaildFlag                :1;
    CPU_INT08U       RxFaildCtr                 :4;
#endif
    USART_TypeDef*   USARTx;
    CPU_INT08U       WrSynNbr;                            // 同步序列号
    CPU_INT08U       RdSynNbr;                            // 同步序列号
    
//#if MODBUS_CFG_SLAVE_EN == DEF_ENABLED    
//    // 寄存器数据类型
//    CPU_INT16U      *pReg;                              // 寄存器地址指针
//#endif
    
} MODBUS_CH;


typedef union {
  CPU_INT08U    buf1[MB_DATA_NBR_COILS / 8  + 1];
  CPU_INT16U    buf2[MB_DATA_NBR_COILS / 16 + 1];
  CPU_INT32U    buf3[MB_DATA_NBR_COILS / 32 + 1];
} UnionMbCoil;

