redmorningcn/template_stm32_ucos/source/Software/uC-MB/Source/MB.h
typedef union {
  CPU_INT08U    buf1[MB_DATA_NBR_REGS * 2];
  CPU_INT16U    buf2[MB_DATA_NBR_REGS];
  CPU_INT32U    buf3[MB_DATA_NBR_REGS / 2];
} UnionMbReg;

typedef struct {
  CPU_INT16U    NbrCoils;
  CPU_INT16U    NbrRegs;
  CPU_INT08U    Status;
  UnionMbCoil   Coil;
  UnionMbReg    Reg;
} StrMbData;

extern StrMbData   mbData;

/*$PAGE*/
/*
*********************************************************************************************************
*                                           GLOBAL VARIABLES
*********************************************************************************************************
*/

#if (MODBUS_CFG_RTU_EN == DEF_ENABLED)
MB_EXT   CPU_INT16U      MB_RTU_Freq;                  /* Frequency at which RTU timer is running                          */
MB_EXT   CPU_INT32U      MB_RTU_TmrCtr;                /* Incremented every Modbus RTU timer interrupt                     */
#if OS_VERSION > 30000U
MB_EXT   OS_SEM          MB_OS_RxSemTbl[MODBUS_CFG_MAX_CH];// 无名沈修改：从静态变改成全局变量
MB_EXT   OS_SEM          MB_OS_TxSemTbl[MODBUS_CFG_MAX_CH];// 无名沈增加：从静态变改成全局变量
#else
MB_EXT   OS_SEM         *MB_OS_RxSemTbl[MODBUS_CFG_MAX_CH];// 无名沈修改：从静态变改成全局变量
MB_EXT   OS_SEM         *MB_OS_TxSemTbl[MODBUS_CFG_MAX_CH];// 无名沈增加：从静态变改成全局变量
#endif
#endif

MB_EXT   CPU_INT08U      MB_ChCtr;                     /* Modbus channel counter (0..MODBUS_MAX_CH)                        */
MB_EXT   MODBUS_CH       MB_ChTbl[MODBUS_CFG_MAX_CH];  /* Modbus channels                                                  */

/*
*********************************************************************************************************
*                                           GLOBAL VARIABLES
*********************************************************************************************************
*/

extern  CPU_INT32U  const  MB_TotalRAMSize;
extern  CPU_INT16U  const  MB_ChSize;

/*
*********************************************************************************************************
*                                  MODBUS INTERFACE FUNCTION PROTOTYPES
*                                               (MB.C)
*********************************************************************************************************
*/

void          MB_Init                   (CPU_INT32U  freq);

void          MB_Exit                   ( void );

MODBUS_CH    *MB_CfgCh                  (CPU_INT08U  node_addr,
                                         CPU_INT08U  master_slave,
                                         CPU_INT32U  rx_timeout,
                                         CPU_INT08U  modbus_mode,
                                         CPU_INT08U  port_nbr,
                                         CPU_INT32U  baud,
                                         CPU_INT08U  bits,
                                         CPU_INT08U  parity,
                                         CPU_INT08U  stops,
                                         CPU_INT08U  wr_en);

void          MB_MasterTimeoutSet       (MODBUS_CH  *pch,
                                         CPU_INT32U  timeout);

void          MB_ModeSet                (MODBUS_CH  *pch,
                                         CPU_INT08U  master_slave,
                                         CPU_INT08U  mode);

void          MB_NodeAddrSet            (MODBUS_CH  *pch,
                                         CPU_INT08U  addr);

void          MB_WrEnSet                (MODBUS_CH  *pch,
                                         CPU_INT08U  wr_en);

void          MB_ChToPortMap            (MODBUS_CH  *pch,
                                         CPU_INT08U  port_nbr);

#if (MODBUS_CFG_ASCII_EN == DEF_ENABLED)
void          MB_ASCII_RxByte           (MODBUS_CH   *pch,
                                         CPU_INT08U   rx_byte);
#endif

#if (MODBUS_CFG_RTU_EN == DEF_ENABLED)
void          MB_RTU_RxByte             (MODBUS_CH   *pch,
                                         CPU_INT08U   rx_byte);

void          MB_RTU_TmrReset           (MODBUS_CH   *pch);       /* Resets the Frame Sync timer.                                 */

void          MB_RTU_TmrResetAll        (void);                   /* Resets all the RTU timers                                    */

void          MB_RTU_TmrUpdate          (void);
#endif

void          MB_RxByte                 (MODBUS_CH   *pch,
                                         CPU_INT08U   rx_byte);

void          MB_RxTask                 (MODBUS_CH   *pch);

void          MB_Tx                     (MODBUS_CH   *pch);

void          MB_TxByte                 (MODBUS_CH   *pch);

#if (MODBUS_CFG_ASCII_EN == DEF_ENABLED)
CPU_BOOLEAN  MB_ASCII_Rx                (MODBUS_CH   *pch);
void         MB_ASCII_Tx                (MODBUS_CH   *pch);
#endif


#if (MODBUS_CFG_RTU_EN == DEF_ENABLED)
CPU_BOOLEAN  MB_RTU_Rx                  (MODBUS_CH   *pch);
void         MB_RTU_Tx                  (MODBUS_CH   *pch);
#endif

/*
*********************************************************************************************************
*                                   RTOS INTERFACE FUNCTION PROTOTYPES
*                                         (defined in mb_os.c)
*********************************************************************************************************
*/

void          MB_OS_Init                (void);

void          MB_OS_Exit                (void);

void          MB_OS_RxSignal            (MODBUS_CH  *pch);

void          MB_OS_RxWait              (MODBUS_CH *pch, CPU_INT16U *perr);

void          MB_OS_TxWait              (MODBUS_CH *pch, CPU_INT16U *perr);

void          MB_OS_TxOver              (MODBUS_CH *pch);

/*
*********************************************************************************************************
*                            COMMON MODBUS ASCII INTERFACE FUNCTION PROTOTYPES
*                                       (defined in mb_util.c)
*********************************************************************************************************
*/

#if (MODBUS_CFG_ASCII_EN == DEF_ENABLED)
CPU_INT08U   *MB_ASCII_BinToHex         (CPU_INT08U  value,
                                         CPU_INT08U *pbuf);

CPU_INT08U    MB_ASCII_HexToBin         (CPU_INT08U *phex);

CPU_INT08U    MB_ASCII_RxCalcLRC        (MODBUS_CH  *pch);

CPU_INT08U    MB_ASCII_TxCalcLRC        (MODBUS_CH  *pch, CPU_INT16U tx_bytes);
#endif

